In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
con = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Par change

In [2]:
name = 'TQM'
old_par= 1.00
new_par = 0.50
ratio = 2
effective_date = '2022-01-13'

### Price table

In [3]:
sql = """
SELECT *
FROM price
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(735, 7)

In [6]:
sql = """
UPDATE price
SET price = price/%s, maxp=maxp/%s, minp=minp/%s, qty=qty*%s, opnp=opnp/%s
WHERE name = '%s' AND date < '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, ratio, name, effective_date)
print(sql)

UPDATE price
SET price = price/2, maxp=maxp/2, minp=minp/2, qty=qty*2, opnp=opnp/2
WHERE name = 'TQM' AND date < '2022-01-13'

In [7]:
rp = con.execute(sql)
rp.rowcount

735

### Buy table

In [8]:
sql = """
SELECT *
FROM buy
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(0, 10)

### Dividend table

In [9]:
sql = """
SELECT *
FROM dividend
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price

,NAME,Q4,Q3,Q2,Q1,DIVIDEND,PRICE,PERCENT,SHARES,XDATE,PAIDDATE,KIND,ACTUAL
0,TQM,1.15,0.0,1.45,0.0,2.6,0.0,0.0,0.0,2021-09-09,2021-09-09,,0

In [12]:
sql = """
UPDATE dividend
SET Q4 = Q4/%s, Q3 = Q3/%s, Q2 = Q2/%s, Q1 = Q1/%s, DIVIDEND=DIVIDEND/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, ratio,  name)
print(sql)

UPDATE dividend
SET Q4 = Q4/2, Q3 = Q3/2, Q2 = Q2/2, Q1 = Q1/2, DIVIDEND=DIVIDEND/2
WHERE name = 'TQM'

In [13]:
rp = con.execute(sql)
rp.rowcount

1

### EPSS table

In [14]:
sql = """
SELECT *
FROM epss
WHERE name = '%s'
"""
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.shape

(13, 14)

In [22]:
sql = """
UPDATE epss
SET q_eps = q_eps/%s, y_eps = y_eps/%s, aq_eps = aq_eps/%s, ay_eps = ay_eps/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE epss
SET q_eps = q_eps/2, y_eps = y_eps/2, aq_eps = aq_eps/2, ay_eps = ay_eps/2
WHERE name = 'TQM'

In [18]:
rp = conlt.execute(sql)
rp.rowcount

3

In [21]:
rp = conpg.execute(sql)
rp.rowcount

10

### CONSENSUS table

In [23]:
sql = """
SELECT *
FROM consensus
WHERE name = '%s'
"""
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.columns

Index(['id', 'name', 'price', 'buy', 'hold', 'sell', 'eps_a', 'eps_b', 'pe',
       'pbv', 'yield', 'target_price', 'status', 'ticker_id', 'created_at',
       'updated_at'],
      dtype='object')

In [24]:
sql = """
UPDATE consensus
SET price = price/%s, eps_a = eps_a/%s, eps_b = eps_b/%s, target_price = target_price/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE consensus
SET price = price/2, eps_a = eps_a/2, eps_b = eps_b/2, target_price = target_price/2
WHERE name = 'TQM'

In [25]:
rp = conlt.execute(sql)
rp.rowcount

1

In [26]:
rp = conmy.execute(sql)
rp.rowcount

1

In [27]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [28]:
sql = """
SELECT *
FROM buys JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
"""
sql = sql % (name)
buys = pd.read_sql(sql, conpf)
buys

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart,id,name,category_id,website
0,990,181,2021-08-16,900,112.0,208.66,14.61,Sold,101023.27,DTD,None,181,TQM,2,
1,899,181,2021-05-21,900,112.0,208.66,14.61,Sold,101023.27,DTD,None,181,TQM,2,

In [29]:
sql = """
UPDATE buys
SET price = price/%s, qty = qty*%s
WHERE stock_id = 181
"""
sql = sql % (ratio, ratio)
print(sql)

UPDATE buys
SET price = price/2, qty = qty*2
WHERE stock_id = 181

In [30]:
rp = conpf.execute(sql)
rp.rowcount

2

In [31]:
sql = """
SELECT *
FROM sells LIMIT 1"""
df_tmp = pd.read_sql(sql, conpf)
df_tmp.columns

Index(['id', 'buy_id', 'date', 'price', 'fee', 'vat', 'net', 'days', 'profit',
       'percent', 'yearly', 'sequence', 'chart', 'dividend_id'],
      dtype='object')

In [32]:
sql = """
SELECT *
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
"""
sql = sql % (name)
sells = pd.read_sql(sql, conpf)
sells

,id,buy_id,date,price,fee,vat,net,days,profit,percent,...,fee,vat,status,net,kind,chart,id,name,category_id,website
0,839,990,2021-09-21,108.0,201.2,14.08,96984.72,36,-4038.55,-3.99764,...,208.66,14.61,Sold,101023.27,DTD,None,181,TQM,2,
1,840,899,2021-09-21,108.0,201.2,14.08,96984.72,123,-4038.55,-3.99764,...,208.66,14.61,Sold,101023.27,DTD,None,181,TQM,2,

In [33]:
sql = '''
UPDATE sells
SET price = price/%s
WHERE buy_id IN (990, 899)
'''
sql = sql % (ratio)
print(sql)

UPDATE sells
SET price = price/2
WHERE buy_id IN (990, 899)

In [34]:
rp = conpf.execute(sql)
rp.rowcount

2

### End of Process